**`teams/oasys/weblogic_appserver`** terragrunt plan on `pull_request` event [#165](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 2s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Read complete after 1s [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be created
  + resource "aws_imagebuilder_distribution_configuration" "this" {
      + arn          = (known after apply)
      + date_created = (known after apply)
      + date_updated = (known after apply)
      + description  = "oasys weblogic app server image"
      + id           = (known after apply)
      + name         = "oasys_weblogic_app"
      + tags         = {
          + "application"                  = "OASYS"
          + "branch"                       = "main"
          + "business-unit"                = "HMPPS"
          + "image-pipeline"               = "oasys_weblogic_app"
          + "image-recipe"                 = "oasys_weblogic_app/0.0.1"
          + "infrastructure-configuration" = "oasys_weblogic_app/0.0.1"
          + "is-production"                = "true"
          + "os-version"                   = "rhel 7.9"
          + "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"             = "release"
          + "server-type"                  = "oasys-weblogic"
          + "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/oasys"
          + "update-linux-version"         = "1.0.2"
        }
      + tags_all     = {
          + "application"                  = "OASYS"
          + "branch"                       = "main"
          + "business-unit"                = "HMPPS"
          + "image-pipeline"               = "oasys_weblogic_app"
          + "image-recipe"                 = "oasys_weblogic_app/0.0.1"
          + "infrastructure-configuration" = "oasys_weblogic_app/0.0.1"
          + "is-production"                = "true"
          + "os-version"                   = "rhel 7.9"
          + "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"             = "release"
          + "server-type"                  = "oasys-weblogic"
          + "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/oasys"
          + "update-linux-version"         = "1.0.2"
        }

      + distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this will be created
  + resource "aws_imagebuilder_image_pipeline" "this" {
      + arn                              = (known after apply)
      + date_created                     = (known after apply)
      + date_last_run                    = (known after apply)
      + date_next_run                    = (known after apply)
      + date_updated                     = (known after apply)
      + description                      = "oasys weblogic app server image"
      + distribution_configuration_arn   = (known after apply)
      + enhanced_image_metadata_enabled  = true
      + id                               = (known after apply)
      + image_recipe_arn                 = (known after apply)
      + infrastructure_configuration_arn = (known after apply)
      + name                             = "oasys_weblogic_app"
      + platform                         = (known after apply)
      + status                           = "ENABLED"
      + tags                             = {
          + "application"                  = "OASYS"
          + "branch"                       = "main"
          + "business-unit"                = "HMPPS"
          + "image-pipeline"               = "oasys_weblogic_app"
          + "image-recipe"                 = "oasys_weblogic_app/0.0.1"
          + "infrastructure-configuration" = "oasys_weblogic_app/0.0.1"
          + "is-production"                = "true"
          + "os-version"                   = "rhel 7.9"
          + "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"             = "release"
          + "server-type"                  = "oasys-weblogic"
          + "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/oasys"
          + "update-linux-version"         = "1.0.2"
        }
      + tags_all                         = {
          + "application"                  = "OASYS"
          + "branch"                       = "main"
          + "business-unit"                = "HMPPS"
          + "image-pipeline"               = "oasys_weblogic_app"
          + "image-recipe"                 = "oasys_weblogic_app/0.0.1"
          + "infrastructure-configuration" = "oasys_weblogic_app/0.0.1"
          + "is-production"                = "true"
          + "os-version"                   = "rhel 7.9"
          + "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"             = "release"
          + "server-type"                  = "oasys-weblogic"
          + "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/oasys"
          + "update-linux-version"         = "1.0.2"
        }

      + image_tests_configuration {
          + image_tests_enabled = false
          + timeout_minutes     = 720
        }

      + schedule {
          + pipeline_execution_start_condition = "EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE"
          + schedule_expression                = "cron(0 0 2 * ? *)"
          + timezone                           = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this will be created
  + resource "aws_imagebuilder_image_recipe" "this" {
      + arn              = (known after apply)
      + date_created     = (known after apply)
      + description      = "oasys weblogic app server image"
      + id               = (known after apply)
      + name             = "oasys_weblogic_app"
      + owner            = (known after apply)
      + parent_image     = (sensitive)
      + platform         = (known after apply)
      + tags             = {
          + "application"                  = "OASYS"
          + "branch"                       = "main"
          + "business-unit"                = "HMPPS"
          + "image-pipeline"               = "oasys_weblogic_app"
          + "image-recipe"                 = "oasys_weblogic_app/0.0.1"
          + "infrastructure-configuration" = "oasys_weblogic_app/0.0.1"
          + "is-production"                = "true"
          + "os-version"                   = "rhel 7.9"
          + "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"             = "release"
          + "server-type"                  = "oasys-weblogic"
          + "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/oasys"
          + "update-linux-version"         = "1.0.2"
        }
      + tags_all         = {
          + "application"                  = "OASYS"
          + "branch"                       = "main"
          + "business-unit"                = "HMPPS"
          + "image-pipeline"               = "oasys_weblogic_app"
          + "image-recipe"                 = "oasys_weblogic_app/0.0.1"
          + "infrastructure-configuration" = "oasys_weblogic_app/0.0.1"
          + "is-production"                = "true"
          + "os-version"                   = "rhel 7.9"
          + "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"             = "release"
          + "server-type"                  = "oasys-weblogic"
          + "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/oasys"
          + "update-linux-version"         = "1.0.2"
        }
      + user_data_base64 = (known after apply)
      + version          = "0.0.1"

      + block_device_mapping {
          + device_name = "/dev/sdb"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 100
              + volume_type           = "gp3"
            }
        }

      + component {
          + component_arn = "arn:aws:imagebuilder:eu-west-2:aws:component/update-linux/x.x.x"
        }
      + component {
          + component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/ansible/0.0.6"

          + parameter {
              + name  = "Ami"
              + value = "oasys_weblogic_app"
            }
          + parameter {
              + name  = "Branch"
              + value = "main"
            }
        }

      + systems_manager_agent {
          + uninstall_after_build = false
        }
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this will be created
  + resource "aws_imagebuilder_infrastructure_configuration" "this" {
      + arn                           = (known after apply)
      + date_created                  = (known after apply)
      + date_updated                  = (known after apply)
      + description                   = "oasys weblogic app server image"
      + id                            = (known after apply)
      + instance_profile_name         = "ImageBuilder"
      + instance_types                = [
          + "t2.large",
        ]
      + name                          = "oasys_weblogic_app_0_0_1"
      + resource_tags                 = {
          + "application"                  = "OASYS"
          + "branch"                       = "main"
          + "business-unit"                = "HMPPS"
          + "image-pipeline"               = "oasys_weblogic_app"
          + "image-recipe"                 = "oasys_weblogic_app/0.0.1"
          + "infrastructure-configuration" = "oasys_weblogic_app/0.0.1"
          + "is-production"                = "true"
          + "os-version"                   = "rhel 7.9"
          + "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"             = "release"
          + "server-type"                  = "oasys-weblogic"
          + "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/oasys"
          + "update-linux-version"         = "1.0.2"
        }
      + security_group_ids            = [
          + "sg-0987edc89553585ad",
        ]
      + subnet_id                     = "subnet-014d083e052388b2a"
      + tags                          = {
          + "application"                  = "OASYS"
          + "branch"                       = "main"
          + "business-unit"                = "HMPPS"
          + "image-pipeline"               = "oasys_weblogic_app"
          + "image-recipe"                 = "oasys_weblogic_app/0.0.1"
          + "infrastructure-configuration" = "oasys_weblogic_app/0.0.1"
          + "is-production"                = "true"
          + "os-version"                   = "rhel 7.9"
          + "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"             = "release"
          + "server-type"                  = "oasys-weblogic"
          + "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/oasys"
          + "update-linux-version"         = "1.0.2"
        }
      + tags_all                      = {
          + "application"                  = "OASYS"
          + "branch"                       = "main"
          + "business-unit"                = "HMPPS"
          + "image-pipeline"               = "oasys_weblogic_app"
          + "image-recipe"                 = "oasys_weblogic_app/0.0.1"
          + "infrastructure-configuration" = "oasys_weblogic_app/0.0.1"
          + "is-production"                = "true"
          + "os-version"                   = "rhel 7.9"
          + "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"             = "release"
          + "server-type"                  = "oasys-weblogic"
          + "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/oasys"
          + "update-linux-version"         = "1.0.2"
        }
      + terminate_instance_on_failure = true

      + logging {
          + s3_logs {
              + s3_bucket_name = "ec2-image-builder-logs-20211019134837153100000001"
              + s3_key_prefix  = "oasys"
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + parent_ami = {}

```
